<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetPageProperty("CLASS_PAGE_TITLE", "instapaper_title entry-title");
$APPLICATION->SetPageProperty("CLASS_PAGE_CONTAINER", "instapaper_body hentry full-width");
$APPLICATION->SetPageProperty("title", "Кickgoods — Кикгудс. Магазин оригинальных редких гаджетов с Kickstarter.");
$APPLICATION->SetTitle("О магазине");
?><div id="page-content" class="rte">
    <p dir="ltr">Kickgoods (Кикгудс) — интернет-магазин, специализирующийся на оригинальных гаджетах от независимых разработчиков, чье появление стало возможным лишь благодаря Кикстартеру<em><span style="color: #;">*</span></em>. Магазин запущен в 2012 году.</p>
<p dir="ltr"><img style="float: left; margin: 0 20px 20px 0!important; border: 1px solid #fff;" src="https://cdn.shopify.com/s/files/1/0202/0694/files/wRmzEvaoMHo.png" /></p>
<div>Инновационность, нестандартность и штучность большинства устройств, получающих финансирование на Кикстартере, — вот что привлекает к ним внимание и интерес гаджетоманов со всего мира.</div>
<p dir="ltr">К сожалению, изобретения с Кикстартера были до недавнего времени почти недоступны покупателям из России. Виной тому и малый интерес компаний-разработчиков к нашему рынку, и отсутствие желания отечественных поставщиков брать на себя риск работы с «малораскрученными» экспериментальными изобретениями.</p>
<p dir="ltr">Цель нашего магазина — сделать эти опережающие время технические новинки, многие из которых редкость на прилавках американских магазинов, доступными жителям России.</p>
<p>Поскольку мы стараемся работать непосредственно с производителями и их официальными представителями, каждый наш покупатель застрахован от подделок.</p>
<p>Вы можете <a href="http://www.kickgoods.ru/pages/delivery">оплатить свой заказ</a> в магазине онлайн, наличными курьеру или при самовывозе. Мы можем организовать доставку до двери как по Москве, так и по всей России.</p>
<hr>
<p><strong>ИП Макеев Дмитрий Николаевич</strong></br>ИНН: 772392138702</br>ОГРНИП: 311774629700853</br>Расчётный счёт № 40802810000240000188</br>в ОАО Банк «Северный морской путь» (АО «СМП Банк»)</br>ОКПО: 56657657</br>ОГРН:1097711000078</br>ИНН: 7750005482</br>КПП: 775001001</br>Кор. счёт: 30101810300000000503</br>в Отделении 1 Московского ГТУ Банка России</br>БИК: 044583503</p>
<hr>
<p style="color: #aaa;"><em><span style="color: #ff0000;">*</span> <a href="http://www.kickstarter.com">Кикстартер</a> — сайт, посредством которого люди объединяются и спонсируют реализацию опубликованных изобретателями идей. Это называется краудфандинг. Как это работает? Представьте, если, миллион человек скинется по доллару — наберется миллион долларов, проект будет реализован, мечта изобретателя осуществится, но самое главное — в мире появится новый </em><em>полезный и нужный людям</em><em> продукт. Собственно, это там и происходит.</em><em> </em></p>
  </div><!-- #page-content -->

<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>