<?
$MESS['EDOST_DELIVERY_TARIFF'] = array(
	'title' => array( // названия тарифов
		1 => 'Почта России (отправление 1-го класса)',
		2 => 'Почта России (наземная посылка)',
		3 => 'EMS Почта России',
		5 => 'СПСР Экспресс (пеликан-стандарт)',
		6 => 'СДЭК (экспресс - курьером до двери)',
		7 => 'СДЭК (экспресс - до пункта выдачи)', // старый тариф
		8 => 'СДЭК (экспресс - курьером до двери)', // старый тариф
		9 => 'СДЭК (экспресс - до пункта выдачи)',
		10 => 'СДЭК (супер-экспресс - курьером до двери)',
		11 => 'DHL Express (экспресс 18:00)',
		12 => 'UPS (Express Saver)',
		14 => 'ЖелДорЭкспедиция (до терминала)',
		15 => 'Автотрейдинг (до терминала)',
		16 => 'ПЭК (до терминала)',
		17 => 'СДЭК (международный экспресс)',
		18 => 'EMS Почта России (международное отправление)',
		19 => 'СПСР Экспресс (международное отправление)',
		20 => 'DHL Express (экспресс за границу)',
		21 => 'UPS (международный Express Saver)',
		22 => 'Деловые линии (до терминала)',
		23 => 'Мегаполис (дверь-дверь)', // старый тариф
		24 => 'Мегаполис', // тариф 'терминал-дверь'
		25 => 'Гарантпост',
		26 => 'Гарантпост (международное отправление)',
		27 => 'PONY EXPRESS',
		28 => 'PONY EXPRESS (международное отправление)',
		29 => 'PickPoint (постаматы и пункты выдачи)',
		31 => 'Курьер', // тариф 1
		32 => 'Курьер', // тариф 2
		33 => 'Курьер', // тариф 3
		34 => 'Курьер', // тариф 4
		35 => 'Самовывоз', // тариф 1
		36 => 'boxberry (до пункта выдачи)',
		37 => 'СДЭК (посылка - до пункта выдачи)',
		38 => 'СДЭК (посылка - курьером до двери)',
		39 => 'Энергия (авто - до терминала)',
		40 => 'Энергия (жд - до терминала)',
		41 => 'Энергия (авиа - до терминала)',
		42 => 'Энергия (морем - до терминала)',
		43 => 'boxberry (курьером до двери)',
		44 => 'DPD (classic - курьером до двери)',
		45 => 'DPD (consumer - курьером до двери)',
		46 => 'DPD (parcel - до пункта выдачи)',
		47 => 'DPD (parcel - курьером до двери)',
		48 => 'ЖелДорЭкспедиция (до подъезда)',
		49 => 'ПЭК (до подъезда)',
		50 => 'Автотрейдинг (до подъезда)',
		51 => 'Деловые линии (до подъезда)',
		52 => 'Энергия (авто - до подъезда)',
		53 => 'Энергия (жд - до подъезда)',
		54 => 'Энергия (авиа - до подъезда)',
		55 => 'Энергия (морем - до подъезда)',
		56 => 'Самовывоз', // тариф 2
		57 => 'Самовывоз', // тариф 3
		58 => 'Самовывоз', // тариф 4
	),
	'title_insurance' => array( // названия тарифов со страховкой
		1 => 'Почта России (отправление 1-го класса со страховкой)',
		2 => 'Почта России (наземная посылка со страховкой)',
		3 => 'EMS Почта России (со страховкой)',
		5 => 'СПСР Экспресс (пеликан-стандарт со страховкой)',
		6 => 'СДЭК (экспресс - курьером до двери со страховкой)',
		7 => 'СДЭК (экспресс - до пункта выдачи со страховкой)', // старый тариф
		8 => 'СДЭК (экспресс - курьером до двери со страховкой)', // старый тариф
		9 => 'СДЭК (экспресс - до пункта выдачи со страховкой)',
		10 => 'СДЭК (супер-экспресс - курьером до двери со страховкой)',
		11 => 'DHL Express (экспресс 18:00 со страховкой)',
		12 => 'UPS (Express Saver со страховкой)',
		14 => 'ЖелДорЭкспедиция (до терминала со страховкой)',
		15 => 'Автотрейдинг (до терминала со страховкой)',
		16 => 'ПЭК (до терминала со страховкой)',
		17 => 'СДЭК (международный экспресс со страховкой)',
		18 => 'EMS Почта России (международное отправление со страховкой)',
		19 => 'СПСР Экспресс (международное отправление со страховкой)',
		20 => 'DHL Express (экспресс за границу со страховкой)',
		21 => 'UPS (международный Express Saver со страховкой)',
		22 => 'Деловые линии (до терминала со страховкой)',
		23 => 'Мегаполис (дверь-дверь со страховкой)', // старый тариф
		24 => 'Мегаполис (со страховкой)', // тариф 'терминал-дверь'
		25 => 'Гарантпост (со страховкой)',
		26 => 'Гарантпост (международное отправление со страховкой)',
		27 => 'PONY EXPRESS (со страховкой)',
		28 => 'PONY EXPRESS (международное отправление со страховкой)',
		29 => 'PickPoint (постаматы и пункты выдачи со страховкой)',
		31 => 'Курьер', // тариф 1
		32 => 'Курьер', // тариф 2
		33 => 'Курьер', // тариф 3
		34 => 'Курьер', // тариф 4
		35 => 'Самовывоз', // тариф 1
		36 => 'boxberry (до пункта выдачи со страховкой)',
		37 => 'СДЭК (посылка - до пункта выдачи со страховкой)',
		38 => 'СДЭК (посылка - курьером до двери со страховкой)',
		39 => 'Энергия (авто - до терминала со страховкой)',
		40 => 'Энергия (жд - до терминала со страховкой)',
		41 => 'Энергия (авиа - до терминала со страховкой)',
		42 => 'Энергия (морем - до терминала со страховкой)',
		43 => 'boxberry (курьером до двери со страховкой)',
		44 => 'DPD (classic - курьером до двери со страховкой)',
		45 => 'DPD (consumer - курьером до двери со страховкой)',
		46 => 'DPD (parcel - до пункта выдачи со страховкой)',
		47 => 'DPD (parcel - курьером до двери со страховкой)',
		48 => 'ЖелДорЭкспедиция (до подъезда со страховкой)',
		49 => 'ПЭК (до подъезда со страховкой)',
		50 => 'Автотрейдинг (до подъезда со страховкой)',
		51 => 'Деловые линии (до подъезда со страховкой)',
		52 => 'Энергия (авто - до подъезда со страховкой)',
		53 => 'Энергия (жд - до подъезда со страховкой)',
		54 => 'Энергия (авиа - до подъезда со страховкой)',
		55 => 'Энергия (морем - до подъезда со страховкой)',
		56 => 'Самовывоз', // тариф 2
		57 => 'Самовывоз', // тариф 3
		58 => 'Самовывоз', // тариф 4
	),
	'description' => array( // описание тарифов
		3 => '<span style="font-size: 12px; color: #F00;">В небольших населенных пунктах доставка производится только до почтового отделения!</span>', // EMS
	),
	'description_insurance' => array( // описание тарифов со страховкой
		3 => '<span style="font-size: 12px; color: #F00;">В небольших населенных пунктах доставка производится только до почтового отделения!</span>', // EMS
	),

	'module_name' => 'eDost',
	'module_description_inner' => '<b style="color: #F00; font-size: 20px;">Предупреждение!!!</b><br><span style="font-size: 16px;"><b style="color: #A00;">Сохранение настроек на текущей странице может привести к непредсказуемому результату<br> и нарушить работу модуля!</b><br><br><b>Все настройки модуля рекомендуется производить только в <a href="edost.php?setting_module=Y">пункте меню eDost</a>.</b></span>',
);


$MESS['EDOST_DELIVERY_COD'] = array(
	array('tariff' => array(1, 2, 3), 'name' => 'Наложенный платеж', 'description' => 'Оплата наличными при получении заказа.'),
	array('tariff' => array(29), 'description2' => 'В постамате заказ можно оплатить наличными или банковской картой Visa и MasterCard.'),
);

$MESS['EDOST_DELIVERY_CONFIG'] = array(
	'head' => 'Параметры',
	'no_change' => 'Не изменять',
	'field' => array(
		'id' => array('TITLE' => 'Идентификатор магазина'),
		'ps' => array('TITLE' => 'Пароль для доступа к серверу расчетов'),
		'host' => array('TITLE' => 'Сервер расчета доставки'),
		'hide_error' => array('TITLE' => 'Скрывать ошибки'),
		'show_zero_tariff' => array('TITLE' => 'Если расчет невозможен, тогда вывести нулевой тариф'),
		'map' => array('TITLE' => 'Включить выбор постаматов и пунктов выдачи на карте'),
		'send_zip' => array('TITLE' => 'Использовать в расчете почтовый индекс'),
		'hide_payment' => array('TITLE' => 'Скрывать способы оплаты, если не рассчитана доставка'),
		'sort_ascending' => array('TITLE' => 'Сортировать тарифы по стоимости'),
		'cod_status' => array('TITLE' => 'При выборе способа оплаты "Наложенный платеж" переводить заказ в статус', 'VALUES' => array()),
		'template' => array('TITLE' => 'Шаблон eDost'),
		'template_format' => array('TITLE' => 'Объединять тарифы по типу доставки', 'VALUES' => array('off' => 'отключено', 'odt' => 'самовывоз, курьер, почта', 'dot' => 'курьер, самовывоз, почта', 'tod' => 'почта, самовывоз, курьер')),
		'template_block' => array('TITLE' => 'Выводить тарифы одного типа отдельными блоками', 'VALUES' => array('off' => 'отключено', 'auto1' => 'только когда много тарифов', 'auto2' => 'только когда много тарифов любого типа', 'all' => 'всегда')),
		'template_block_type' => array('TITLE' => 'Формат отображения', 'VALUES' => array('none' => 'блоки', 'border' => 'блоки с рамкой', 'bookmark1' => 'закладки', 'bookmark2' => 'самые дешевые тарифы')),
		'template_cod' => array('TITLE' => 'Наложенный платеж', 'VALUES' => array('off' => 'только в способах оплаты', 'td' => 'дублировать в колонке у тарифа доставки', 'tr' => 'отдельным тарифом доставки')),
		'template_autoselect_office' => array('TITLE' => 'Автоматически выбирать самый первый пункт выдачи или постамат'),
		'autoselect' => array('TITLE' => 'Автоматически выбирать самый первый способ доставки'),
	),
);

$MESS['EDOST_DELIVERY_WARNING'] = array(
	0 => 'Предупреждение: ',
	1 => 'Почтового отделения с указанным индексом НЕ существует!',
	2 => 'В вашем регионе НЕ найдено почтового отделения с указанным индексом!',
);

$MESS['EDOST_DELIVERY_ERROR'] = array(
	'head' => 'Ошибка: ',
	'office' => 'Невозможна загрузка данных по пунктам выдачи - ',
	'code' => '№ ',
	'no_delivery' => 'Не найдено подходящей службы доставки',
	'tariff_zero' => 'Стоимость доставки будет предоставлена позже',
	'connect' => 'Не удалось рассчитать стоимость доставки (ошибка соединения)',
	2 => 'Доступ к расчету заблокирован',
	3 => 'Неверные данные магазина (пароль или идентификатор)',
	4 => 'Неверные входные параметры',
	5 => 'В выбранное местоположение расчет доставки не производится',
	6 => 'Внутренняя ошибка сервера расчетов',
	7 => 'Не заданы компании доставки в настройках магазина',
	8 => 'Сервер расчета не отвечает',
	9 => 'Превышен лимит расчетов за день',
	11 => 'У товаров не задан вес',
	12 => 'Не заданы данные магазина (пароль или идентификатор)',
	14 => 'Настройки сервера не позволяют отправить запрос на расчет',
	17 => 'Вес больше 100 000 кг',
	18 => 'Страховка превышает 10 000 000 рублей',
	19 => 'Неверный код страны',
	20 => 'Неверный код региона (в стране нет такого региона)',
);

$MESS['EDOST_DELIVERY_RENAME'] = array(
	'company' => array(
		array('ЖелДорЭкспедиция', 'Почта России'), // что менять
		array('ЖелДор', 'Почта'), // на что менять
	),
	'name' => array(
		array('отправление 1-го класса', 'наземная посылка'), // что менять
		array('1-й класс', 'посылка'), // на что менять
	),
);

$MESS['EDOST_DELIVERY_SIGN'] = array(
	'from' => 'от ',
	'to' => ' до ',
	'metro' => 'м. ',
	'map' => 'показать на карте',
	'map2' => 'показать<br> на карте',
	'change' => 'выбрать другой...',
	'loading' => 'обработка...',
	'loading2' => 'загрузка...',
	'insurance' => 'со страховкой',
	'insurance_head' => 'Страховка включена во все тарифы',
	'address' => 'адрес',
	'address2' => 'адрес самовывоза',
	'delivery_company' => 'служба доставки',
	'code' => 'код филиала',
	'tel' => 'телефон',
	'schedule' => 'часы работы',
	'shop' => 'Магазин',
	'office' => 'Пункт выдачи',
	'terminal' => 'Терминал ТК',
	'delivery_unchecked' => 'Не выбран способ доставки',
	'office_unchecked' => 'Не выбрана точка самовывоза',

	'codplus' => 'Стоимость доставки увеличится на <b>%codplus%</b>',
	'transfer' => '+ доплатить при получении за денежный перевод <b>%transfer%</b>',
	'codtotal' => 'Итого переплата за наложенный платеж: <b>%codtotal%</b>',
	'price_head' => 'с предоплатой<br>заказа',
	'cod_head' => 'с оплатой<br>при получении',
	'cod_head_bookmark' => '+ возможна оплата<br>при получении',

	'free' => 'Бесплатно!',
	'free_bitrix' => '<font color="#009900"><b>Бесплатно!</b></font>',
	'priceinfo_warning' => 'Оплачивать доставку необходимо самостоятельно при получении в офисе ТК. <br> Стоимость доставки ориентировочная и на момент оплаты может измениться!',
	'priceinfo_warning_bitrix' => '<span style="color: #F00; font-size: 11px; font-weight: bold;">Оплачивать доставку необходимо самостоятельно при получении.</span> <br> Ориентировочная стоимость: <b>%price_info%</b>',
	'house_warning' => 'Выгрузка и подъем на этаж в стоимость не входят!',
	'house_warning_bitrix' => '<span style="color: #F00; font-size: 11px; font-weight: bold;">Выгрузка и подъем на этаж в стоимость не входят!</span>',
	'terminal_warning' => 'Служба доставки может изменить терминал выдачи по своему усмотрению!',
	'terminal_warning_bitrix' => '<span style="color: #F00; font-size: 11px; font-weight: bold;">Служба доставки может изменить терминал выдачи по своему усмотрению!</span>',
	'priceinfo_description' => '<b>+ %price%</b> за доставку до склада транспортной компании (включается в заказ)',
	'template_warning' => '<b style="color: #F00;">Ошибка: не установлен шаблон eDost!</b>',

	'shop_company_default' => array(
		'Курьер',
		'Курьером до двери',
		'Курьер магазина',
		'Самовывоз',
		'Самовывоз из магазина',
	),
	'delivery' => array(
		'postamat' => 'Доставка в постамат',
		'office' => 'Доставка в пункт выдачи',
		'terminal' => 'Доставка на терминал',
	),
	'hide' => array(
		'курьером до двери',
		'до пункта выдачи',
		'до терминала',
		'до подъезда',
	),
	'postamat' => array(
		'name' => 'Постамат',
		'head' => 'До постамата',
		'get' => 'Выбрать постамат или пункт выдачи',
		'pvz' => 'ПВЗ',
		'rf' => 'Российская Федерация',
	),
	'bookmark' => array(
		'office' => 'Самовывоз',
		'door' => 'До двери',
		'house' => 'До подъезда',
		'post' => 'Почта',
		'general' => 'Другие...',
		'show' => 'Другие...',
	),
);

$MESS['EDOST_DELIVERY_FORMAT'] = array(
	'general' => array(
		'head' => 'Другие способы доставки',
	),
	'post' => array(
		'head' => 'Почта',
	),
	'shop' => array(
		'name' => 'Самовывоз из магазина',
		'get' => 'выбрать магазин на карте...',
	),
	'door' => array(
		'name' => 'Курьером до двери',
	),
	'office' => array(
		'name' => 'До пункта выдачи',
		'get' => 'выбрать пункт выдачи на карте...',
	),
	'terminal' => array(
		'name' => 'До терминала ТК',
		'head' => 'До терминала транспортной компании',
		'get' => 'выбрать терминал на карте...',
	),
	'house' => array(
		'name' => 'До подъезда',
	),
);


$MESS['SALE_DH_EDOST_INSURANCE'] = 'со страховкой';

?>