<?
$MESS["GARPUN_ADVERTISING_MODULE_NAME"] = "Контекстные кампании из XML";
$MESS["GARPUN_ADVERTISING_MODULE_DESC"] = "Создавайте контекстные кампании в Яндекс Директ и Google Adwords, используя данные об актуальных товарах, их цене и характеристиках из каталога Вашего сайта. Данное решение позволит Вам не только создать контекстные кампании с множеством низкочастотных ключевых запросов, но и регулярно обновлять данные в кампаниях в случае изменения товаров в Вашем каталоге или цен на эти товары. 
Решение на базе сервиса Гарпун позволяет создавать кампании как по всем позициям из Вашего каталога, так и по выбранным Вами категориям и/или брендам. 

Если у Вас уже есть решение для создания файла выгрузки на Яндекс Маркет, то Вы можете использовать, имеющийся YML-файл. Если же его у Вас еще нет, то в рамках нашего решения мы поможем Вам создать выгрузку на Яндекс Маркет из товарных позиций в Вашем каталоге. 
Решение работает на Ваших аккаунтах в контекстных сетях Яндекс Директ и Google Adwords с помощью системы автоматизации контекстной рекламы Garpun. 
<>
Для студий, агентств и веб-мастеров существует бонусная программа, позволяющая получать отчисления от ежемесячных платежей за использование сервиса клиентом. ";
$MESS["GARPUN_ADVERTISING_PARTNER_NAME"] = "garpun";
$MESS["GARPUN_ADVERTISING_PARTNER_URI"] = "http://garpun.com"; 
$MESS["GARPUN_ADVERTISING_DELETE_TEXT"] = "Я согласен снять все кампании с обновления"; 
$MESS["GARPUN_ADVERTISING_DELETE_ERROR"] = "Созданные кампании необходимо снять с обновления"; 
?>
